updated 05-wazuh-deployment.md
